general/english/en_vocab_diff.org
#+SETUPFILE: ../../styles/readtheorg.setup
#+TITLE: English Vocabulary Differentiation

* Noun
** anger

| anger       |      | the most general one                                                      |
|-------------+------+---------------------------------------------------------------------------|
| wrath       | 愤怒 | great anger                                                               |
|             |      | suggests a desire on _intent to revenge or punish_                        |
|-------------+------+---------------------------------------------------------------------------|
| rage        | 狂怒 | wild, violent anger                                                       |
|             |      | suggests _loss of self-control_ from violence of emotion                  |
|-------------+------+---------------------------------------------------------------------------|
| fury        | 暴怒 | violent, extreme and destructive anger                                    |
|-------------+------+---------------------------------------------------------------------------|
| indignation | 愤慨 | stresses _righteous_ anger at what one considers unfair, mean or shameful |
|             |      | e.g. We expressed our indignation at the ruthless exploitation.           |

** clothes

| clothes  | coverings of the body such as coats, dresses, suits, shoes, hats       |
|----------+------------------------------------------------------------------------|
| clothing | general term of clothes                                                |
|----------+------------------------------------------------------------------------|
| garment  | a suit of clothes used by actors                                       |
|          | a single article of clothing                                           |
|----------+------------------------------------------------------------------------|
| dress    | clothes worn on _special occasions_                                    |
|          | e.g. evening dress, morning dress                                      |
|----------+------------------------------------------------------------------------|
| costume  | the fashion of dress peculiar to a people, nation, class, period, etc. |
|          | a dress worn by actors in a play                                       |
|----------+------------------------------------------------------------------------|
| uniform  | clothes worn by all members of the community                           |
|----------+------------------------------------------------------------------------|
| suit     | a set of outer clothes to be worn together                             |
|          | e.g. evening suit, swimming suit                                       |

** event

| event      | 事件     | an important happening, often celebrated, such as birthday or anniversary     |
|------------+----------+-------------------------------------------------------------------------------|
| incident   |          | not as important as an event, seldom celebrated                               |
|------------+----------+-------------------------------------------------------------------------------|
| happening  | 偶然事件 | an occurrence, sometimes an unusual one                                       |
|            |          | e.g. There have been strange happenings here lately.                          |
|------------+----------+-------------------------------------------------------------------------------|
| occurrence |          | an incident that is usually unexpected and has not been planned ahead of time |
|            |          | e.g. Flood is practically an annual occurrence in this district.              |

** fight

| fight    |      | a bodily struggle                                                                              |
|----------+------+------------------------------------------------------------------------------------------------|
| struggle |      | an effort of any kind to overcome difficulty                                                   |
|----------+------+------------------------------------------------------------------------------------------------|
| battle   | 战斗 | a fight between armed forces                                                                   |
|----------+------+------------------------------------------------------------------------------------------------|
| combat   | 对抗 | a fight, conflict, controversy                                                                 |
|----------+------+------------------------------------------------------------------------------------------------|
| campaign | 战役 | a series of related military operations in a war                                               |
|----------+------+------------------------------------------------------------------------------------------------|
| war      |      | a period of fight between countries or states when weapons are used and many people are killed |
  
