general/english/en_vocab_diff.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>English Vocabulary Differentiation</title>
<!-- 2016-05-22 周日 09:22 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />

<link rel="stylesheet" type="text/css" href="../../styles/readtheorg/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="../../styles/readtheorg/css/font.css"/>
<link rel="stylesheet" type="text/css" href="../../styles/readtheorg/css/readtheorg.css"/>





</head>
<body>
<div id="content">
<h1 class="title">English Vocabulary Differentiation</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. Noun</a>
<ul>
<li><a href="#sec-1-1">1.1. anger</a></li>
<li><a href="#sec-1-2">1.2. clothes</a></li>
<li><a href="#sec-1-3">1.3. event</a></li>
<li><a href="#sec-1-4">1.4. fight</a></li>
<li><a href="#sec-1-5">1.5. mistake</a></li>
<li><a href="#sec-1-6">1.6. period</a></li>
<li><a href="#sec-1-7">1.7. picture</a></li>
<li><a href="#sec-1-8">1.8. priest</a></li>
<li><a href="#sec-1-9">1.9. situation</a></li>
<li><a href="#sec-1-10">1.10. thief</a></li>
<li><a href="#sec-1-11">1.11. thing</a></li>
<li><a href="#sec-1-12">1.12. way</a></li>
</ul>
</li>
<li><a href="#sec-2">2. Verb</a>
<ul>
<li><a href="#sec-2-1">2.1. agree</a></li>
<li><a href="#sec-2-2">2.2. break</a></li>
<li><a href="#sec-2-3">2.3. cancel</a></li>
<li><a href="#sec-2-4">2.4. chat</a></li>
<li><a href="#sec-2-5">2.5. cry</a></li>
<li><a href="#sec-2-6">2.6. destroy</a></li>
<li><a href="#sec-2-7">2.7. pull</a></li>
<li><a href="#sec-2-8">2.8. tell</a></li>
<li><a href="#sec-2-9">2.9. shake</a></li>
<li><a href="#sec-2-10">2.10. speak</a></li>
<li><a href="#sec-2-11">2.11. turn</a></li>
<li><a href="#sec-2-12">2.12. walk</a></li>
</ul>
</li>
<li><a href="#sec-3">3. Adjective</a>
<ul>
<li><a href="#sec-3-1">3.1. beautiful</a></li>
<li><a href="#sec-3-2">3.2. famous</a></li>
<li><a href="#sec-3-3">3.3. special</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Noun</h2>
<div class="outline-text-2" id="text-1">
</div><div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1"><span class="section-number-3">1.1</span> anger</h3>
<div class="outline-text-3" id="text-1-1">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />

<col  class="left" />

<col  class="left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="left">anger</th>
<th scope="col" class="left">&#xa0;</th>
<th scope="col" class="left">the most general one</th>
</tr>
</thead>
<tbody>
<tr>
<td class="left">wrath</td>
<td class="left">愤怒</td>
<td class="left">great anger</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">suggests a desire on <span class="underline">intent to revenge or punish</span></td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left">rage</td>
<td class="left">狂怒</td>
<td class="left">wild, violent anger</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">suggests <span class="underline">loss of self-control</span> from violence of emotion</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left">fury</td>
<td class="left">暴怒</td>
<td class="left">violent, extreme and destructive anger</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left">indignation</td>
<td class="left">愤慨</td>
<td class="left">stresses <span class="underline">righteous</span> anger at what one considers unfair, mean or shameful</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">e.g. We expressed our indignation at the ruthless exploitation.</td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-sec-1-2" class="outline-3">
<h3 id="sec-1-2"><span class="section-number-3">1.2</span> clothes</h3>
<div class="outline-text-3" id="text-1-2">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />

<col  class="left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="left">clothes</th>
<th scope="col" class="left">coverings of the body such as coats, dresses, suits, shoes, hats</th>
</tr>
</thead>
<tbody>
<tr>
<td class="left">clothing</td>
<td class="left">general term of clothes</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left">garment</td>
<td class="left">a suit of clothes used by actors</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">a single article of clothing</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left">dress</td>
<td class="left">clothes worn on <span class="underline">special occasions</span></td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">e.g. evening dress, morning dress</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left">costume</td>
<td class="left">the fashion of dress peculiar to a people, nation, class, period, etc.</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">a dress worn by actors in a play</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left">uniform</td>
<td class="left">clothes worn by all members of the community</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left">suit</td>
<td class="left">a set of outer clothes to be worn together</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">e.g. evening suit, swimming suit</td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-sec-1-3" class="outline-3">
<h3 id="sec-1-3"><span class="section-number-3">1.3</span> event</h3>
<div class="outline-text-3" id="text-1-3">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />

<col  class="left" />

<col  class="left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="left">event</th>
<th scope="col" class="left">事件</th>
<th scope="col" class="left">an important happening, often celebrated, such as birthday or anniversary</th>
</tr>
</thead>
<tbody>
<tr>
<td class="left">incident</td>
<td class="left">&#xa0;</td>
<td class="left">not as important as an event, seldom celebrated</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left">happening</td>
<td class="left">偶然事件</td>
<td class="left">an occurrence, sometimes an unusual one</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">e.g. There have been strange happenings here lately.</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left">occurrence</td>
<td class="left">&#xa0;</td>
<td class="left">an incident that is usually unexpected and has not been planned ahead of time</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">e.g. Flood is practically an annual occurrence in this district.</td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-sec-1-4" class="outline-3">
<h3 id="sec-1-4"><span class="section-number-3">1.4</span> fight</h3>
<div class="outline-text-3" id="text-1-4">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />

<col  class="left" />

<col  class="left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="left">fight</th>
<th scope="col" class="left">&#xa0;</th>
<th scope="col" class="left">a bodily struggle</th>
</tr>
</thead>
<tbody>
<tr>
<td class="left">struggle</td>
<td class="left">&#xa0;</td>
<td class="left">an effort of any kind to overcome difficulty</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left">battle</td>
<td class="left">战斗</td>
<td class="left">a fight between armed forces</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left">combat</td>
<td class="left">对抗</td>
<td class="left">a fight, conflict, controversy</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left">campaign</td>
<td class="left">战役</td>
<td class="left">a series of related military operations in a war</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left">war</td>
<td class="left">&#xa0;</td>
<td class="left">a period of fight between countries or states when weapons are used and many people are killed</td>
</tr>
</tbody>
</table>
</div>
</div>
