general/english/en_vocab_diff.org
** mistake

| mistake     |            | a wrong thought or act                                                                            |
|             |            | implies _carelessness_                                                                            |
|             |            | e.g. Anyone can make a mistake.                                                                   |
|-------------+------------+---------------------------------------------------------------------------------------------------|
| error       | 疏忽       | a mistake (formal sometimes literary)                                                             |
|             |            | implies _deviation_ from a standard or model                                                      |
|             |            | e.g. The accident was caused by human error.                                                      |
|-------------+------------+---------------------------------------------------------------------------------------------------|
| fault       | 过错，弱点 | a bad point, but not of a serious moral kind                                                      |
|             |            | refers to behavior and character                                                                  |
|             |            | e.g. His only fault is that he lacks ambition.                                                    |
|-------------+------------+---------------------------------------------------------------------------------------------------|
| blunder     | 过失       | a very stupid or unnecessary mistake                                                              |
|             |            | implies _ignorance_                                                                               |
|             |            | e.g. This is the fatal blunder of his life.                                                       |
|-------------+------------+---------------------------------------------------------------------------------------------------|
| shortcoming | 缺点       | weakness, failing                                                                                 |
|             |            | refers to failures or _deficiencies_                                                              |
|             |            | e.g. In spite of all her shortcomings I still think she's one of the best teachers in the school. |
|-------------+------------+---------------------------------------------------------------------------------------------------|
| defect      | 缺陷       | sth. lacking or imperfect                                                                         |
|             |            | refers to _quality_                                                                               |
|             |            | e.g. The radio was returned because of a defect.                                                  |

** period

| period  |      | a passage of time, great or small                                                                |
|         |      | an extent of time of any length                                                                  |
|---------+------+--------------------------------------------------------------------------------------------------|
| time(s) | 时代 | a period in history                                                                              |
|         |      | e.g. in ancient times, in Victoria time                                                          |
|---------+------+--------------------------------------------------------------------------------------------------|
| age     | 时代 | a particular or fairly definite period in history                                                |
|         |      | e.g. the Bronze Age, the Iron Age                                                                |
|---------+------+--------------------------------------------------------------------------------------------------|
| epoch   | 纪元 | a long period of time marked by events or development of a particular kind                       |
|         |      | e.g. The first flight into space marked a new epoch in the history of mankind.                   |
|---------+------+--------------------------------------------------------------------------------------------------|
| era     | 时期 | a very long period of time marked by a particular feature in a great new era of world revolution |
  
** picture

| picture      |        | the most general one                                                          |
|--------------+--------+-------------------------------------------------------------------------------|
| painting     | 彩图   | a picture with color                                                          |
|--------------+--------+-------------------------------------------------------------------------------|
| drawing      | 图画   | a picture made with a pen, pencil and crayon                                  |
|--------------+--------+-------------------------------------------------------------------------------|
| sketch       | 草图   | a rough, not detailed drawing                                                 |
|--------------+--------+-------------------------------------------------------------------------------|
| diagram      | 图表   | a drawing with figures that shows the arrangement of sth.                     |
|--------------+--------+-------------------------------------------------------------------------------|
| graph        | 曲线图 | a diagram in which lines show how sets of numbers or measurements are related |
|--------------+--------+-------------------------------------------------------------------------------|
| illustration | 插图   | a picture to go with words of a book                                          |
|--------------+--------+-------------------------------------------------------------------------------|
| draft        | 草图   | the first rough written form of anything                                      |
|--------------+--------+-------------------------------------------------------------------------------|
| plan         | 平面图 | a line drawing of a building as it might been seen from above                 |
|--------------+--------+-------------------------------------------------------------------------------|
| elevation    | 主视图 | a flat upright side of a building                                             |
|--------------+--------+-------------------------------------------------------------------------------|
| chart        | 海图   | a map, esp. a detailed map of a sea area                                      |

