general/english/en_vocab_diff.html
<div id="outline-container-sec-1-5" class="outline-3">
<h3 id="sec-1-5"><span class="section-number-3">1.5</span> mistake</h3>
<div class="outline-text-3" id="text-1-5">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />

<col  class="left" />

<col  class="left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="left">mistake</th>
<th scope="col" class="left">&#xa0;</th>
<th scope="col" class="left">a wrong thought or act</th>
</tr>

<tr>
<th scope="col" class="left">&#xa0;</th>
<th scope="col" class="left">&#xa0;</th>
<th scope="col" class="left">implies <span class="underline">carelessness</span></th>
</tr>

<tr>
<th scope="col" class="left">&#xa0;</th>
<th scope="col" class="left">&#xa0;</th>
<th scope="col" class="left">e.g. Anyone can make a mistake.</th>
</tr>
</thead>
<tbody>
<tr>
<td class="left">error</td>
<td class="left">疏忽</td>
<td class="left">a mistake (formal sometimes literary)</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">implies <span class="underline">deviation</span> from a standard or model</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">e.g. The accident was caused by human error.</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left">fault</td>
<td class="left">过错，弱点</td>
<td class="left">a bad point, but not of a serious moral kind</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">refers to behavior and character</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">e.g. His only fault is that he lacks ambition.</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left">blunder</td>
<td class="left">过失</td>
<td class="left">a very stupid or unnecessary mistake</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">implies <span class="underline">ignorance</span></td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">e.g. This is the fatal blunder of his life.</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left">shortcoming</td>
<td class="left">缺点</td>
<td class="left">weakness, failing</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">refers to failures or <span class="underline">deficiencies</span></td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">e.g. In spite of all her shortcomings I still think she's one of the best teachers in the school.</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left">defect</td>
<td class="left">缺陷</td>
<td class="left">sth. lacking or imperfect</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">refers to <span class="underline">quality</span></td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">e.g. The radio was returned because of a defect.</td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-sec-1-6" class="outline-3">
<h3 id="sec-1-6"><span class="section-number-3">1.6</span> period</h3>
<div class="outline-text-3" id="text-1-6">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />

<col  class="left" />

<col  class="left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="left">period</th>
<th scope="col" class="left">&#xa0;</th>
<th scope="col" class="left">a passage of time, great or small</th>
</tr>

<tr>
<th scope="col" class="left">&#xa0;</th>
<th scope="col" class="left">&#xa0;</th>
<th scope="col" class="left">an extent of time of any length</th>
</tr>
</thead>
<tbody>
<tr>
<td class="left">time(s)</td>
<td class="left">时代</td>
<td class="left">a period in history</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">e.g. in ancient times, in Victoria time</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left">age</td>
<td class="left">时代</td>
<td class="left">a particular or fairly definite period in history</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">e.g. the Bronze Age, the Iron Age</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left">epoch</td>
<td class="left">纪元</td>
<td class="left">a long period of time marked by events or development of a particular kind</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">e.g. The first flight into space marked a new epoch in the history of mankind.</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left">era</td>
<td class="left">时期</td>
<td class="left">a very long period of time marked by a particular feature in a great new era of world revolution</td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-sec-1-7" class="outline-3">
<h3 id="sec-1-7"><span class="section-number-3">1.7</span> picture</h3>
<div class="outline-text-3" id="text-1-7">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />

<col  class="left" />

<col  class="left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="left">picture</th>
<th scope="col" class="left">&#xa0;</th>
<th scope="col" class="left">the most general one</th>
</tr>
</thead>
<tbody>
<tr>
<td class="left">painting</td>
<td class="left">彩图</td>
<td class="left">a picture with color</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left">drawing</td>
<td class="left">图画</td>
<td class="left">a picture made with a pen, pencil and crayon</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left">sketch</td>
<td class="left">草图</td>
<td class="left">a rough, not detailed drawing</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left">diagram</td>
<td class="left">图表</td>
<td class="left">a drawing with figures that shows the arrangement of sth.</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left">graph</td>
<td class="left">曲线图</td>
<td class="left">a diagram in which lines show how sets of numbers or measurements are related</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left">illustration</td>
<td class="left">插图</td>
<td class="left">a picture to go with words of a book</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left">draft</td>
<td class="left">草图</td>
<td class="left">the first rough written form of anything</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left">plan</td>
<td class="left">平面图</td>
<td class="left">a line drawing of a building as it might been seen from above</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left">elevation</td>
<td class="left">主视图</td>
<td class="left">a flat upright side of a building</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left">chart</td>
<td class="left">海图</td>
<td class="left">a map, esp. a detailed map of a sea area</td>
</tr>
</tbody>
</table>
</div>
</div>
