general/english/en_vocab_diff.org
** priest

| priest   | a person specially trained for various religious duties and ceremonies, esp. in the Roman Catholic church |
|----------+-----------------------------------------------------------------------------------------------------------|
| father   | a little of respect for a priest                                                                          |
|----------+-----------------------------------------------------------------------------------------------------------|
| clergy   | the officially appointed leader of the religious activities of a particular church or temple              |
|----------+-----------------------------------------------------------------------------------------------------------|
| minister | a member of clergy, esp. in a Protestant church                                                           |
|----------+-----------------------------------------------------------------------------------------------------------|
| pastor   | a Christian religious leader in charge of a church and its members, esp. in a Protestant church           |
|----------+-----------------------------------------------------------------------------------------------------------|
| vicar    | a priest in charge of an area(parish) in the church of England                                            |

** situation

| situation      | a position or state at a particular time, set of conditions, facts, and events         |
|                | suggests more general matters such as government planning and finance                  |
|                | e.g. The political situation in these countries are always changing.                   |
|----------------+----------------------------------------------------------------------------------------|
| conditions     | the location and other factors likely to affect sth.                                   |
|                | suggests sth. that has stayed the same for some time and which affects daily life      |
|                | e.g. We are now studying the economic conditions in the developing countries.          |
|----------------+----------------------------------------------------------------------------------------|
| environment    | the circumstances, things and conditions that influence                                |
|                | refers to spirit, physical and material aspect                                         |
|                | e.g. We must try to beautify our environment.                                          |
|----------------+----------------------------------------------------------------------------------------|
| surrounding(s) | the area and environment around a place or person                                      |
|                | indicates a very narrow condition                                                      |
|                | e.g. They lived in hostile surroundings.                                               |
|----------------+----------------------------------------------------------------------------------------|
| circumstance   | a situation or event around us, an atmosphere, the conditions that affect what happens |

** thief

| thief    | the most general one                                                                  |
|----------+---------------------------------------------------------------------------------------|
| robber   | suggests a direct confrontation in which the owner is forced to give up his valuables |
|----------+---------------------------------------------------------------------------------------|
| mugger   | a person who attacks and robs people in a street or in a lift                         |
|----------+---------------------------------------------------------------------------------------|
| burglar  | a person who breaks into a house at night to steal sth.                               |
|----------+---------------------------------------------------------------------------------------|
| gangster | a member of a group of criminals, esp. those who are armed and use guns to threaten   |
|----------+---------------------------------------------------------------------------------------|
| bandit   | an armed robber                                                                       |
|          | suggests an organized group in a rural setting                                        |
|----------+---------------------------------------------------------------------------------------|
| brigand  | a robber who lives by robbing travelers in the country                                |
|----------+---------------------------------------------------------------------------------------|
| pirate   | a person who robs on the sea                                                          |

** thing

| thing    |      | an event; a fact; a subject                                     |
|----------+------+-----------------------------------------------------------------|
| matter   |      | sth. to be dealt with, to be discussed, to be thought over      |
|          |      | e.g. There are several matters to be dealt with at the meeting. |
|----------+------+-----------------------------------------------------------------|
| business | 事务 | a special duty; sth. that has to be done                        |
|          |      | e.g. Public business is every one's business.                   |
|----------+------+-----------------------------------------------------------------|
| affair   | 事务 | an event or set of connected events                             |
|          |      | e.g. I have many affairs to look after.                         |

** way

| way    | room for an object to proceed.                                                                             |
|--------+------------------------------------------------------------------------------------------------------------|
| road   | a prepared way for traveling with horses or vehicles                                                       |
|--------+------------------------------------------------------------------------------------------------------------|
| path   | a way suitable to be traveled only by foot passengers or by animals                                        |
|--------+------------------------------------------------------------------------------------------------------------|
| route  | a line of travel, and may be over many roads                                                               |
|--------+------------------------------------------------------------------------------------------------------------|
| street | a road in some centre of habitation, as a city town or village, when it passes between houses of dwellings |
|--------+------------------------------------------------------------------------------------------------------------|
| avenue | a long, broad and imposing or principal street                                                             |

* Verb
