general/english/en_vocab_diff.html
<div id="outline-container-sec-1-8" class="outline-3">
<h3 id="sec-1-8"><span class="section-number-3">1.8</span> priest</h3>
<div class="outline-text-3" id="text-1-8">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />

<col  class="left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="left">priest</th>
<th scope="col" class="left">a person specially trained for various religious duties and ceremonies, esp. in the Roman Catholic church</th>
</tr>
</thead>
<tbody>
<tr>
<td class="left">father</td>
<td class="left">a little of respect for a priest</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left">clergy</td>
<td class="left">the officially appointed leader of the religious activities of a particular church or temple</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left">minister</td>
<td class="left">a member of clergy, esp. in a Protestant church</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left">pastor</td>
<td class="left">a Christian religious leader in charge of a church and its members, esp. in a Protestant church</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left">vicar</td>
<td class="left">a priest in charge of an area(parish) in the church of England</td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-sec-1-9" class="outline-3">
<h3 id="sec-1-9"><span class="section-number-3">1.9</span> situation</h3>
<div class="outline-text-3" id="text-1-9">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />

<col  class="left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="left">situation</th>
<th scope="col" class="left">a position or state at a particular time, set of conditions, facts, and events</th>
</tr>

<tr>
<th scope="col" class="left">&#xa0;</th>
<th scope="col" class="left">suggests more general matters such as government planning and finance</th>
</tr>

<tr>
<th scope="col" class="left">&#xa0;</th>
<th scope="col" class="left">e.g. The political situation in these countries are always changing.</th>
</tr>
</thead>
<tbody>
<tr>
<td class="left">conditions</td>
<td class="left">the location and other factors likely to affect sth.</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">suggests sth. that has stayed the same for some time and which affects daily life</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">e.g. We are now studying the economic conditions in the developing countries.</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left">environment</td>
<td class="left">the circumstances, things and conditions that influence</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">refers to spirit, physical and material aspect</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">e.g. We must try to beautify our environment.</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left">surrounding(s)</td>
<td class="left">the area and environment around a place or person</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">indicates a very narrow condition</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">e.g. They lived in hostile surroundings.</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left">circumstance</td>
<td class="left">a situation or event around us, an atmosphere, the conditions that affect what happens</td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-sec-1-10" class="outline-3">
<h3 id="sec-1-10"><span class="section-number-3">1.10</span> thief</h3>
<div class="outline-text-3" id="text-1-10">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />

<col  class="left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="left">thief</th>
<th scope="col" class="left">the most general one</th>
</tr>
</thead>
<tbody>
<tr>
<td class="left">robber</td>
<td class="left">suggests a direct confrontation in which the owner is forced to give up his valuables</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left">mugger</td>
<td class="left">a person who attacks and robs people in a street or in a lift</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left">burglar</td>
<td class="left">a person who breaks into a house at night to steal sth.</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left">gangster</td>
<td class="left">a member of a group of criminals, esp. those who are armed and use guns to threaten</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left">bandit</td>
<td class="left">an armed robber</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">suggests an organized group in a rural setting</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left">brigand</td>
<td class="left">a robber who lives by robbing travelers in the country</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left">pirate</td>
<td class="left">a person who robs on the sea</td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-sec-1-11" class="outline-3">
<h3 id="sec-1-11"><span class="section-number-3">1.11</span> thing</h3>
<div class="outline-text-3" id="text-1-11">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />

<col  class="left" />

<col  class="left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="left">thing</th>
<th scope="col" class="left">&#xa0;</th>
<th scope="col" class="left">an event; a fact; a subject</th>
</tr>
</thead>
<tbody>
<tr>
<td class="left">matter</td>
<td class="left">&#xa0;</td>
<td class="left">sth. to be dealt with, to be discussed, to be thought over</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">e.g. There are several matters to be dealt with at the meeting.</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left">business</td>
<td class="left">事务</td>
<td class="left">a special duty; sth. that has to be done</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">e.g. Public business is every one's business.</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left">affair</td>
<td class="left">事务</td>
<td class="left">an event or set of connected events</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">e.g. I have many affairs to look after.</td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-sec-1-12" class="outline-3">
<h3 id="sec-1-12"><span class="section-number-3">1.12</span> way</h3>
<div class="outline-text-3" id="text-1-12">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />

<col  class="left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="left">way</th>
<th scope="col" class="left">room for an object to proceed.</th>
</tr>
</thead>
<tbody>
<tr>
<td class="left">road</td>
<td class="left">a prepared way for traveling with horses or vehicles</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left">path</td>
<td class="left">a way suitable to be traveled only by foot passengers or by animals</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left">route</td>
<td class="left">a line of travel, and may be over many roads</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left">street</td>
<td class="left">a road in some centre of habitation, as a city town or village, when it passes between houses of dwellings</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left">avenue</td>
<td class="left">a long, broad and imposing or principal street</td>
</tr>
</tbody>
</table>
</div>
</div>
</div>
