general/english/en_vocab_diff.org
** agree

| agree       |                                                                                      |
|-------------+--------------------------------------------------------------------------------------|
| admit       | to agree to the truth of, usually sth. bad                                           |
|             | suggests reluctance or possible objection                                            |
|             | e.g. He admitted his crime.                                                          |
|-------------+--------------------------------------------------------------------------------------|
| acknowledge | to agree the truth of, to recognize the fact or existence of                         |
|             | emphasizes openly in an embarrassing or awkward and usually not voluntary way        |
|             | e.g. I acknowledged my signature.                                                    |
|-------------+--------------------------------------------------------------------------------------|
| grant       | to admit or to agree sth. is true                                                    |
|             | e.g. I granted his request.                                                          |
|-------------+--------------------------------------------------------------------------------------|
| concede     | to admit as true, just or proper, often unwillingly because of overwhelming evidence |
|             | e.g. I conceded you that point, but I still think you are wrong.                     |
|-------------+--------------------------------------------------------------------------------------|
| recognize   | to accept or acknowledge                                                             |
|             | refers to law or diplomacy                                                           |
|             | e.g. The new regime was recognized by China.                                         |

** break

| break   |      | the most general one                                                       |
|---------+------+----------------------------------------------------------------------------|
| crush   | 压碎 | to press together violently as to break, to destroy its shape by squeezing |
|         |      | suggests the effect of _great external pressure_                           |
|         |      | e.g. The tree fell on top of the car and crushed it.                       |
|---------+------+----------------------------------------------------------------------------|
| crash   |      | refers to the _vehicle hitting_ sth. and is badly damaged                  |
|---------+------+----------------------------------------------------------------------------|
| smash   |      | to break thoroughly _to pieces_ with a crushing sound                      |
|         |      | e.g. She dropped the plate and smashed it.                                 |
|---------+------+----------------------------------------------------------------------------|
| shatter | 砸碎 | to break into pieces                                                       |
|         |      | suggests the breaking up of a _thin surface_                               |
|         |      | e.g. The glass was shattered to pieces.                                    |
|---------+------+----------------------------------------------------------------------------|
| crack   | 打裂 | to break without separation of parts                                       |
|         |      | suggests the breaking out _across a surface_                               |
|         |      | e.g. He cracked the window by leaning against it.                          |
|---------+------+----------------------------------------------------------------------------|
| burst   | 破裂 | to break open by _pressure from within_                                    |
|         |      | e.g. The fireworks burst while they were in the air.                       |

** cancel

| cancel      | 取消 | to give up, to declare sth. is to be ineffective        |
|             |      | e.g. He has cancelled his leave of absence.             |
|-------------+------+---------------------------------------------------------|
| abolish     | 废除 | to do away with                                         |
|             |      | refers to practices, social institutions                |
|             |      | e.g. Bad customs should be abolished.                   |
|-------------+------+---------------------------------------------------------|
| repeal      | 废除 | to bring to an end of the effect of a law or an order   |
|             |      | e.g. Some laws should be repealed.                      |

** chat

| chat     |   | to talk in a friendly, familiar, informal manner                      |
|          |   | e.g. The two friends sat in a corner and chatted.                     |
|----------+---+-----------------------------------------------------------------------|
| chatter  |   | to talk continuously rapidly about small things                       |
|          |   | e.g. The schoolgirls went along chattering.                           |
|----------+---+-----------------------------------------------------------------------|
| converse |   | to talk formally                                                      |
|          |   | e.g. The scholars are conversing with each other on linguistics.      |
|----------+---+-----------------------------------------------------------------------|
| gossip   |   | to talk about the details of other people's actions and private lives |
|          |   | e.g. That woman is very fond of gossiping about others.               |

