general/english/en_vocab_diff.html
<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Verb</h2>
<div class="outline-text-2" id="text-2">
</div><div id="outline-container-sec-2-1" class="outline-3">
<h3 id="sec-2-1"><span class="section-number-3">2.1</span> agree</h3>
<div class="outline-text-3" id="text-2-1">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />

<col  class="left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="left">agree</th>
<th scope="col" class="left">&#xa0;</th>
</tr>
</thead>
<tbody>
<tr>
<td class="left">admit</td>
<td class="left">to agree to the truth of, usually sth. bad</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">suggests reluctance or possible objection</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">e.g. He admitted his crime.</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left">acknowledge</td>
<td class="left">to agree the truth of, to recognize the fact or existence of</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">emphasizes openly in an embarrassing or awkward and usually not voluntary way</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">e.g. I acknowledged my signature.</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left">grant</td>
<td class="left">to admit or to agree sth. is true</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">e.g. I granted his request.</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left">concede</td>
<td class="left">to admit as true, just or proper, often unwillingly because of overwhelming evidence</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">e.g. I conceded you that point, but I still think you are wrong.</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left">recognize</td>
<td class="left">to accept or acknowledge</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">refers to law or diplomacy</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">e.g. The new regime was recognized by China.</td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-sec-2-2" class="outline-3">
<h3 id="sec-2-2"><span class="section-number-3">2.2</span> break</h3>
<div class="outline-text-3" id="text-2-2">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />

<col  class="left" />

<col  class="left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="left">break</th>
<th scope="col" class="left">&#xa0;</th>
<th scope="col" class="left">the most general one</th>
</tr>
</thead>
<tbody>
<tr>
<td class="left">crush</td>
<td class="left">压碎</td>
<td class="left">to press together violently as to break, to destroy its shape by squeezing</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">suggests the effect of <span class="underline">great external pressure</span></td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">e.g. The tree fell on top of the car and crushed it.</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left">crash</td>
<td class="left">&#xa0;</td>
<td class="left">refers to the <span class="underline">vehicle hitting</span> sth. and is badly damaged</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left">smash</td>
<td class="left">&#xa0;</td>
<td class="left">to break thoroughly <span class="underline">to pieces</span> with a crushing sound</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">e.g. She dropped the plate and smashed it.</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left">shatter</td>
<td class="left">砸碎</td>
<td class="left">to break into pieces</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">suggests the breaking up of a <span class="underline">thin surface</span></td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">e.g. The glass was shattered to pieces.</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left">crack</td>
<td class="left">打裂</td>
<td class="left">to break without separation of parts</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">suggests the breaking out <span class="underline">across a surface</span></td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">e.g. He cracked the window by leaning against it.</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left">burst</td>
<td class="left">破裂</td>
<td class="left">to break open by <span class="underline">pressure from within</span></td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">e.g. The fireworks burst while they were in the air.</td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-sec-2-3" class="outline-3">
<h3 id="sec-2-3"><span class="section-number-3">2.3</span> cancel</h3>
<div class="outline-text-3" id="text-2-3">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />

<col  class="left" />

<col  class="left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="left">cancel</th>
<th scope="col" class="left">取消</th>
<th scope="col" class="left">to give up, to declare sth. is to be ineffective</th>
</tr>

<tr>
<th scope="col" class="left">&#xa0;</th>
<th scope="col" class="left">&#xa0;</th>
<th scope="col" class="left">e.g. He has cancelled his leave of absence.</th>
</tr>
</thead>
<tbody>
<tr>
<td class="left">abolish</td>
<td class="left">废除</td>
<td class="left">to do away with</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">refers to practices, social institutions</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">e.g. Bad customs should be abolished.</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left">repeal</td>
<td class="left">废除</td>
<td class="left">to bring to an end of the effect of a law or an order</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">e.g. Some laws should be repealed.</td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-sec-2-4" class="outline-3">
<h3 id="sec-2-4"><span class="section-number-3">2.4</span> chat</h3>
<div class="outline-text-3" id="text-2-4">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />

<col  class="left" />

<col  class="left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="left">chat</th>
<th scope="col" class="left">&#xa0;</th>
<th scope="col" class="left">to talk in a friendly, familiar, informal manner</th>
</tr>

<tr>
<th scope="col" class="left">&#xa0;</th>
<th scope="col" class="left">&#xa0;</th>
<th scope="col" class="left">e.g. The two friends sat in a corner and chatted.</th>
</tr>
</thead>
<tbody>
<tr>
<td class="left">chatter</td>
<td class="left">&#xa0;</td>
<td class="left">to talk continuously rapidly about small things</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">e.g. The schoolgirls went along chattering.</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left">converse</td>
<td class="left">&#xa0;</td>
<td class="left">to talk formally</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">e.g. The scholars are conversing with each other on linguistics.</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left">gossip</td>
<td class="left">&#xa0;</td>
<td class="left">to talk about the details of other people's actions and private lives</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">e.g. That woman is very fond of gossiping about others.</td>
</tr>
</tbody>
</table>
</div>
</div>
