general/english/en_vocab_diff.org
** cry

| cry     |          | the most general one                                       |
|---------+----------+------------------------------------------------------------|
| weep    | 哭泣     | to let flow tears                                          |
|---------+----------+------------------------------------------------------------|
| sob     | 抽泣     | to weep or sigh with short quick breaths                   |
|---------+----------+------------------------------------------------------------|
| snivel  | 涕泪交流 | to sniffle and cry in a irritating manner                  |
|---------+----------+------------------------------------------------------------|
| blubber | 哭嚎     | to cry loudly noisily                                      |
|---------+----------+------------------------------------------------------------|
| bawl    | 哭嚎     | to utter loud cries (always in bad sense)                  |
|---------+----------+------------------------------------------------------------|
| wail    | 痛哭     | to cry aloud from pain or sorrow                           |
|---------+----------+------------------------------------------------------------|
| moan    | 呻吟     | to make a low, miserable sound in pain or sorrow           |
|---------+----------+------------------------------------------------------------|
| grown   | 呻吟     | to make a low sound of pain, unhappiness or disapproval    |
|---------+----------+------------------------------------------------------------|
| mourn   | 哀悼     | to feel or show sadness or sorrow for someone who has died |
|---------+----------+------------------------------------------------------------|
| lament  | 哀悼     | to express great sorrow or regret                          |
** destroy

| destroy     |      |                                                         |
|-------------+------+---------------------------------------------------------|
| eliminate   | 消灭 | to get rid of                                           |
|             |      | e.g. We should eliminate the false and retain the true. |
|-------------+------+---------------------------------------------------------|
| exterminate | 消灭 | to destroy completely and wholly                        |
|             |      | e.g. Colonialism must be exterminated.                  |

** pull

| pull   |   | the most general one                                                                    |
|--------+---+-----------------------------------------------------------------------------------------|
| draw   |   | a smoother, steadier motion and generally a lighter force than pull                     |
|--------+---+-----------------------------------------------------------------------------------------|
| drag   |   | a horizontal motion or motion up an incline (slope)                                     |
|        |   | suggests laborious efforts over rough ground or against friction, resistance or gravity |
|        |   | e.g. The escaped prisoner was dragged out of his hiding place.                          |
|--------+---+-----------------------------------------------------------------------------------------|
| haul   |   | continuous pulling or dragging of heavy or bulky objects                                |
|        |   | e.g. The fisherman is hauling a net.                                                    |
|--------+---+-----------------------------------------------------------------------------------------|
| tow    |   | to pull by a rope or chain                                                              |
|        |   | e.g. We towed the car to the nearest garage.                                            |
|--------+---+-----------------------------------------------------------------------------------------|
| tug    |   | hard, often sudden, violent effort to pull                                              |
|        |   | e.g. He tugged at my sleeve to ask directions.                                          |
|--------+---+-----------------------------------------------------------------------------------------|
| jerk   |   | to pull suddenly                                                                        |
|        |   | e.g. He jerked out the knife that was stuck in the wound.                               |
|--------+---+-----------------------------------------------------------------------------------------|
| wrench |   | to pull hard with a twisting or turning movement                                        |

** tell

| tell    |      | to let people know about sth.                      |
|---------+------+----------------------------------------------------|
| remark  | 谈论 | to mention or comment on                           |
|---------+------+----------------------------------------------------|
| state   | 陈述 | to say, express or put into words, esp. formally   |
|---------+------+----------------------------------------------------|
| narrate | 讲述 | to tell formally in writing or speech              |
|         |      | to describe sth. in order with intonation          |
|         |      | e.g. He narrated his adventure in the forest.      |
|---------+------+----------------------------------------------------|
| relate  | 详述 | to tell formally in details, to give an account of |
|         |      | e.g. He related his experiences.                   |
|---------+------+----------------------------------------------------|
| address | 讲演 | to say in speech or writing to a person or group   |
|         |      |                                                    |

