general/english/en_vocab_diff.html
<div id="outline-container-sec-2-5" class="outline-3">
<h3 id="sec-2-5"><span class="section-number-3">2.5</span> cry</h3>
<div class="outline-text-3" id="text-2-5">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />

<col  class="left" />

<col  class="left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="left">cry</th>
<th scope="col" class="left">&#xa0;</th>
<th scope="col" class="left">the most general one</th>
</tr>
</thead>
<tbody>
<tr>
<td class="left">weep</td>
<td class="left">哭泣</td>
<td class="left">to let flow tears</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left">sob</td>
<td class="left">抽泣</td>
<td class="left">to weep or sigh with short quick breaths</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left">snivel</td>
<td class="left">涕泪交流</td>
<td class="left">to sniffle and cry in a irritating manner</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left">blubber</td>
<td class="left">哭嚎</td>
<td class="left">to cry loudly noisily</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left">bawl</td>
<td class="left">哭嚎</td>
<td class="left">to utter loud cries (always in bad sense)</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left">wail</td>
<td class="left">痛哭</td>
<td class="left">to cry aloud from pain or sorrow</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left">moan</td>
<td class="left">呻吟</td>
<td class="left">to make a low, miserable sound in pain or sorrow</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left">grown</td>
<td class="left">呻吟</td>
<td class="left">to make a low sound of pain, unhappiness or disapproval</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left">mourn</td>
<td class="left">哀悼</td>
<td class="left">to feel or show sadness or sorrow for someone who has died</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left">lament</td>
<td class="left">哀悼</td>
<td class="left">to express great sorrow or regret</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-sec-2-6" class="outline-3">
<h3 id="sec-2-6"><span class="section-number-3">2.6</span> destroy</h3>
<div class="outline-text-3" id="text-2-6">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />

<col  class="left" />

<col  class="left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="left">destroy</th>
<th scope="col" class="left">&#xa0;</th>
<th scope="col" class="left">&#xa0;</th>
</tr>
</thead>
<tbody>
<tr>
<td class="left">eliminate</td>
<td class="left">消灭</td>
<td class="left">to get rid of</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">e.g. We should eliminate the false and retain the true.</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left">exterminate</td>
<td class="left">消灭</td>
<td class="left">to destroy completely and wholly</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">e.g. Colonialism must be exterminated.</td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-sec-2-7" class="outline-3">
<h3 id="sec-2-7"><span class="section-number-3">2.7</span> pull</h3>
<div class="outline-text-3" id="text-2-7">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />

<col  class="left" />

<col  class="left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="left">pull</th>
<th scope="col" class="left">&#xa0;</th>
<th scope="col" class="left">the most general one</th>
</tr>
</thead>
<tbody>
<tr>
<td class="left">draw</td>
<td class="left">&#xa0;</td>
<td class="left">a smoother, steadier motion and generally a lighter force than pull</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left">drag</td>
<td class="left">&#xa0;</td>
<td class="left">a horizontal motion or motion up an incline (slope)</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">suggests laborious efforts over rough ground or against friction, resistance or gravity</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">e.g. The escaped prisoner was dragged out of his hiding place.</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left">haul</td>
<td class="left">&#xa0;</td>
<td class="left">continuous pulling or dragging of heavy or bulky objects</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">e.g. The fisherman is hauling a net.</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left">tow</td>
<td class="left">&#xa0;</td>
<td class="left">to pull by a rope or chain</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">e.g. We towed the car to the nearest garage.</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left">tug</td>
<td class="left">&#xa0;</td>
<td class="left">hard, often sudden, violent effort to pull</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">e.g. He tugged at my sleeve to ask directions.</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left">jerk</td>
<td class="left">&#xa0;</td>
<td class="left">to pull suddenly</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">e.g. He jerked out the knife that was stuck in the wound.</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left">wrench</td>
<td class="left">&#xa0;</td>
<td class="left">to pull hard with a twisting or turning movement</td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-sec-2-8" class="outline-3">
<h3 id="sec-2-8"><span class="section-number-3">2.8</span> tell</h3>
<div class="outline-text-3" id="text-2-8">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />

<col  class="left" />

<col  class="left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="left">tell</th>
<th scope="col" class="left">&#xa0;</th>
<th scope="col" class="left">to let people know about sth.</th>
</tr>
</thead>
<tbody>
<tr>
<td class="left">remark</td>
<td class="left">谈论</td>
<td class="left">to mention or comment on</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left">state</td>
<td class="left">陈述</td>
<td class="left">to say, express or put into words, esp. formally</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left">narrate</td>
<td class="left">讲述</td>
<td class="left">to tell formally in writing or speech</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">to describe sth. in order with intonation</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">e.g. He narrated his adventure in the forest.</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left">relate</td>
<td class="left">详述</td>
<td class="left">to tell formally in details, to give an account of</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">e.g. He related his experiences.</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left">address</td>
<td class="left">讲演</td>
<td class="left">to say in speech or writing to a person or group</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>
</tbody>
</table>
</div>
</div>
