general/english/en_vocab_diff.org
** shake

| shake   | to move up and down or back and forth                               |
|---------+---------------------------------------------------------------------|
| tremble | to shake uncontrollably and slightly as from fear, cold, excitement |
|         | implies _uneasiness and nervousness_                                |
|         | e.g. Her voice trembled as she began to sing.                       |
|---------+---------------------------------------------------------------------|
| quake   | to shake or tremble violently                                       |
|         | suggests a more _violent and sudden_ change                         |
|         | e.g. He quaked with excitement.                                     |
|---------+---------------------------------------------------------------------|
| quiver  | to tremble a little                                                 |
|         | suggests a _rapid but invisible_ vibration                          |
|         | e.g. His lips quivered with emotion.                                |
|---------+---------------------------------------------------------------------|
| shiver  | to tremble from fear or cold                                        |
|         | suggests a _slight and rapid_ movement                              |
|         | e.g. He stood shivering in the snow.                                |
|---------+---------------------------------------------------------------------|
| shudder | to shake uncontrollably for a movement                              |
|         | suggests a _more intense_ shaking                                   |
|         | e.g. She shuddered at the sight of a snake.                         |

** speak

| speak   |            | to use one's voice to say words                                               |
|---------+------------+-------------------------------------------------------------------------------|
| say     |            | to speak words                                                                |
|---------+------------+-------------------------------------------------------------------------------|
| talk    |            | to say things to someone                                                      |
|---------+------------+-------------------------------------------------------------------------------|
| utter   | 发出声音   | to make sound and say words                                                   |
|---------+------------+-------------------------------------------------------------------------------|
| mutter  | 低语       | to express displeasure with compressed lips                                   |
|---------+------------+-------------------------------------------------------------------------------|
| whisper |            | to talk in a low voice                                                        |
|         |            | e.g. She whispered me not to talk so loudly.                                  |
|---------+------------+-------------------------------------------------------------------------------|
| murmur  |            | to make a soft sound, esp. to speak or say in a quiet voice                   |
|         |            | e.g. He often murmurs to himself.                                             |
|---------+------------+-------------------------------------------------------------------------------|
| drawl   | 拉长声音说 | to speak in a slow, prolonged manner                                          |
|---------+------------+-------------------------------------------------------------------------------|
| rave    | 怒吼       | to talk in an angry, uncontrolled way                                         |
|---------+------------+-------------------------------------------------------------------------------|
| gabble  | 叽里咕噜   | to talk rapidly, making inarticulate sounds                                   |
|---------+------------+-------------------------------------------------------------------------------|
| stammer | 结结巴巴   | to speak with pauses and repeated sounds because of excitement, embarrassment |
|---------+------------+-------------------------------------------------------------------------------|
| stutter |            | to speak with pauses and repeated sounds because of inherent speech defect    |

** turn

| turn    |      | the most general one                                                                          |
|---------+------+-----------------------------------------------------------------------------------------------|
| spin    | 自转 | to turn quickly around a central point                                                        |
|         |      | emphasizes the continuity of the action, and usually the narrow extent of the circular motion |
|---------+------+-----------------------------------------------------------------------------------------------|
| rotate  | 旋转 | to turn round a fixed point with a circular movement                                          |
|         |      | e.g. The earth rotates once every 24 hours.                                                   |
|---------+------+-----------------------------------------------------------------------------------------------|
| revolve | 绕转 | to turn or move in a circle around a central point                                            |
|         |      | indicates circular or elliptical movement                                                     |
|         |      | e.g. The planets revolve around the sun.                                                      |
|---------+------+-----------------------------------------------------------------------------------------------|
| whirl   | 急转 | to round very fast                                                                            |
|         |      | implies the lock of conscious control                                                         |
|         |      | e.g. The leaves whirl in the wind in the yard.                                                |

