general/english/en_vocab_diff.html
<div id="outline-container-sec-2-9" class="outline-3">
<h3 id="sec-2-9"><span class="section-number-3">2.9</span> shake</h3>
<div class="outline-text-3" id="text-2-9">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />

<col  class="left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="left">shake</th>
<th scope="col" class="left">to move up and down or back and forth</th>
</tr>
</thead>
<tbody>
<tr>
<td class="left">tremble</td>
<td class="left">to shake uncontrollably and slightly as from fear, cold, excitement</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">implies <span class="underline">uneasiness and nervousness</span></td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">e.g. Her voice trembled as she began to sing.</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left">quake</td>
<td class="left">to shake or tremble violently</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">suggests a more <span class="underline">violent and sudden</span> change</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">e.g. He quaked with excitement.</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left">quiver</td>
<td class="left">to tremble a little</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">suggests a <span class="underline">rapid but invisible</span> vibration</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">e.g. His lips quivered with emotion.</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left">shiver</td>
<td class="left">to tremble from fear or cold</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">suggests a <span class="underline">slight and rapid</span> movement</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">e.g. He stood shivering in the snow.</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left">shudder</td>
<td class="left">to shake uncontrollably for a movement</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">suggests a <span class="underline">more intense</span> shaking</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">e.g. She shuddered at the sight of a snake.</td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-sec-2-10" class="outline-3">
<h3 id="sec-2-10"><span class="section-number-3">2.10</span> speak</h3>
<div class="outline-text-3" id="text-2-10">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />

<col  class="left" />

<col  class="left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="left">speak</th>
<th scope="col" class="left">&#xa0;</th>
<th scope="col" class="left">to use one's voice to say words</th>
</tr>
</thead>
<tbody>
<tr>
<td class="left">say</td>
<td class="left">&#xa0;</td>
<td class="left">to speak words</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left">talk</td>
<td class="left">&#xa0;</td>
<td class="left">to say things to someone</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left">utter</td>
<td class="left">发出声音</td>
<td class="left">to make sound and say words</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left">mutter</td>
<td class="left">低语</td>
<td class="left">to express displeasure with compressed lips</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left">whisper</td>
<td class="left">&#xa0;</td>
<td class="left">to talk in a low voice</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">e.g. She whispered me not to talk so loudly.</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left">murmur</td>
<td class="left">&#xa0;</td>
<td class="left">to make a soft sound, esp. to speak or say in a quiet voice</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">e.g. He often murmurs to himself.</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left">drawl</td>
<td class="left">拉长声音说</td>
<td class="left">to speak in a slow, prolonged manner</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left">rave</td>
<td class="left">怒吼</td>
<td class="left">to talk in an angry, uncontrolled way</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left">gabble</td>
<td class="left">叽里咕噜</td>
<td class="left">to talk rapidly, making inarticulate sounds</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left">stammer</td>
<td class="left">结结巴巴</td>
<td class="left">to speak with pauses and repeated sounds because of excitement, embarrassment</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left">stutter</td>
<td class="left">&#xa0;</td>
<td class="left">to speak with pauses and repeated sounds because of inherent speech defect</td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-sec-2-11" class="outline-3">
<h3 id="sec-2-11"><span class="section-number-3">2.11</span> turn</h3>
<div class="outline-text-3" id="text-2-11">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />

<col  class="left" />

<col  class="left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="left">turn</th>
<th scope="col" class="left">&#xa0;</th>
<th scope="col" class="left">the most general one</th>
</tr>
</thead>
<tbody>
<tr>
<td class="left">spin</td>
<td class="left">自转</td>
<td class="left">to turn quickly around a central point</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">emphasizes the continuity of the action, and usually the narrow extent of the circular motion</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left">rotate</td>
<td class="left">旋转</td>
<td class="left">to turn round a fixed point with a circular movement</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">e.g. The earth rotates once every 24 hours.</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left">revolve</td>
<td class="left">绕转</td>
<td class="left">to turn or move in a circle around a central point</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">indicates circular or elliptical movement</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">e.g. The planets revolve around the sun.</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left">whirl</td>
<td class="left">急转</td>
<td class="left">to round very fast</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">implies the lock of conscious control</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">e.g. The leaves whirl in the wind in the yard.</td>
</tr>
</tbody>
</table>
</div>
</div>
