general/english/en_vocab_diff.org
** walk

| walk | the most general one |

| stride | to walk with long steps                                                             |
|        | e.g. He strode through the station a few minutes before the train left.             |
|--------+-------------------------------------------------------------------------------------|
| stalk  | to walk stiffly, slowly, and proudly with long steps                                |
|--------+-------------------------------------------------------------------------------------|
| strut  | to walk in a proud strong way, esp. with the chest out and trying to look important |
|--------+-------------------------------------------------------------------------------------|
| trot   | to jog, move quickly, usually refers to horses                                      |

| wander  | to move about without a fixed course, aim, or purpose                           |
|         | e.g. He was wandering about/down/through/up and down the street.                |
|---------+---------------------------------------------------------------------------------|
| roam    | to wander with clear aim                                                        |
|         | suggests a more serious purpose behind the irregular or circular movement       |
|         | e.g. The lovers roamed around the fields.                                       |
|---------+---------------------------------------------------------------------------------|
| stroll  | to walk, esp. slowly, for pleasure                                              |
|         | emphasizes a slower movement, wandering and aimless with many starts and pauses |
|         | e.g. They are strolling through this park.                                      |
|---------+---------------------------------------------------------------------------------|
| saunter | more formal than stroll                                                         |
|---------+---------------------------------------------------------------------------------|
| amble   | to walk at an easy gentle rate                                                  |
|         | stresses a leisurely but regular movement                                       |

| trudge | to walk heavily and wearily with effort as if tired            |
|        | e.g. The hunter was trudging through the deep snow.            |
|--------+----------------------------------------------------------------|
| tramp  | to walk with firm heavy steps                                  |
|        | e.g. Who has been tramping all over the carpet in muddy shoes? |

| waddle  | to walk from side to side with short steps like a duck                     |
|         | e.g. The fat man waddled out of the room.                                  |
|---------+----------------------------------------------------------------------------|
| stagger | to walk unsteadily, slide and drag the feet, almost falling at each step   |
|         | usually because of illness, injury or drink                                |
|         | e.g. After drinking too much, he staggered in the street.                  |
|---------+----------------------------------------------------------------------------|
| totter  | to walk unsteadily, often used of very young children learning to walk     |
|         | e.g. The child tottered before his parents.                                |
|---------+----------------------------------------------------------------------------|
| shuffle | to move without lifting the feet clear of the floor as if wearing slippers |
|         | e.g. The old man shuffled along the road.                                  |
|---------+----------------------------------------------------------------------------|
| mince   | to walk with little short steps in an affected manner                      |
|         | e.g. It was a funny sight to see her mince along.                          |
|---------+----------------------------------------------------------------------------|
| slouch  | to walk in a loose, ungainly way                                           |
|---------+----------------------------------------------------------------------------|
| hustle  | to walk in a busy, active way                                              |

* Adjective
** beautiful

| beautiful    | suggesting symmetry of features or perfection of proportion, elegance and mobility          |
|              | (a woman or a thing)                                                                        |
|--------------+---------------------------------------------------------------------------------------------|
| good-looking | having an attractive appearance in a strong, healthy way used for men and women, not things |
|--------------+---------------------------------------------------------------------------------------------|
| pretty       | suggesting liveliness and sweetness, pleasing or nice to look at                            |
|              | (a girl or a small thing)                                                                   |
|--------------+---------------------------------------------------------------------------------------------|
| lovely       | so beautiful that it makes you feel good to look at it or even to think about it            |
|              | (a thing)                                                                                   |
|--------------+---------------------------------------------------------------------------------------------|
| gorgeous     | extremely beautiful or handsome                                                             |
|--------------+---------------------------------------------------------------------------------------------|
| fair         | beautiful light in color, esp. skin or hair                                                 |
|              | (woman in poet)                                                                             |
