general/english/en_vocab_diff.html
<div id="outline-container-sec-2-12" class="outline-3">
<h3 id="sec-2-12"><span class="section-number-3">2.12</span> walk</h3>
<div class="outline-text-3" id="text-2-12">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />

<col  class="left" />
</colgroup>
<tbody>
<tr>
<td class="left">walk</td>
<td class="left">the most general one</td>
</tr>
</tbody>
</table>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />

<col  class="left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="left">stride</th>
<th scope="col" class="left">to walk with long steps</th>
</tr>

<tr>
<th scope="col" class="left">&#xa0;</th>
<th scope="col" class="left">e.g. He strode through the station a few minutes before the train left.</th>
</tr>
</thead>
<tbody>
<tr>
<td class="left">stalk</td>
<td class="left">to walk stiffly, slowly, and proudly with long steps</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left">strut</td>
<td class="left">to walk in a proud strong way, esp. with the chest out and trying to look important</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left">trot</td>
<td class="left">to jog, move quickly, usually refers to horses</td>
</tr>
</tbody>
</table>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />

<col  class="left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="left">wander</th>
<th scope="col" class="left">to move about without a fixed course, aim, or purpose</th>
</tr>

<tr>
<th scope="col" class="left">&#xa0;</th>
<th scope="col" class="left">e.g. He was wandering about/down/through/up and down the street.</th>
</tr>
</thead>
<tbody>
<tr>
<td class="left">roam</td>
<td class="left">to wander with clear aim</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">suggests a more serious purpose behind the irregular or circular movement</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">e.g. The lovers roamed around the fields.</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left">stroll</td>
<td class="left">to walk, esp. slowly, for pleasure</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">emphasizes a slower movement, wandering and aimless with many starts and pauses</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">e.g. They are strolling through this park.</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left">saunter</td>
<td class="left">more formal than stroll</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left">amble</td>
<td class="left">to walk at an easy gentle rate</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">stresses a leisurely but regular movement</td>
</tr>
</tbody>
</table>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />

<col  class="left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="left">trudge</th>
<th scope="col" class="left">to walk heavily and wearily with effort as if tired</th>
</tr>

<tr>
<th scope="col" class="left">&#xa0;</th>
<th scope="col" class="left">e.g. The hunter was trudging through the deep snow.</th>
</tr>
</thead>
<tbody>
<tr>
<td class="left">tramp</td>
<td class="left">to walk with firm heavy steps</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">e.g. Who has been tramping all over the carpet in muddy shoes?</td>
</tr>
</tbody>
</table>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />

<col  class="left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="left">waddle</th>
<th scope="col" class="left">to walk from side to side with short steps like a duck</th>
</tr>

<tr>
<th scope="col" class="left">&#xa0;</th>
<th scope="col" class="left">e.g. The fat man waddled out of the room.</th>
</tr>
</thead>
<tbody>
<tr>
<td class="left">stagger</td>
<td class="left">to walk unsteadily, slide and drag the feet, almost falling at each step</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">usually because of illness, injury or drink</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">e.g. After drinking too much, he staggered in the street.</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left">totter</td>
<td class="left">to walk unsteadily, often used of very young children learning to walk</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">e.g. The child tottered before his parents.</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left">shuffle</td>
<td class="left">to move without lifting the feet clear of the floor as if wearing slippers</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">e.g. The old man shuffled along the road.</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left">mince</td>
<td class="left">to walk with little short steps in an affected manner</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">e.g. It was a funny sight to see her mince along.</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left">slouch</td>
<td class="left">to walk in a loose, ungainly way</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left">hustle</td>
<td class="left">to walk in a busy, active way</td>
</tr>
</tbody>
</table>
</div>
</div>
</div>
<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> Adjective</h2>
<div class="outline-text-2" id="text-3">
</div><div id="outline-container-sec-3-1" class="outline-3">
<h3 id="sec-3-1"><span class="section-number-3">3.1</span> beautiful</h3>
<div class="outline-text-3" id="text-3-1">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />

<col  class="left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="left">beautiful</th>
<th scope="col" class="left">suggesting symmetry of features or perfection of proportion, elegance and mobility</th>
</tr>

<tr>
<th scope="col" class="left">&#xa0;</th>
<th scope="col" class="left">(a woman or a thing)</th>
</tr>
</thead>
<tbody>
<tr>
<td class="left">good-looking</td>
<td class="left">having an attractive appearance in a strong, healthy way used for men and women, not things</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left">pretty</td>
<td class="left">suggesting liveliness and sweetness, pleasing or nice to look at</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">(a girl or a small thing)</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left">lovely</td>
<td class="left">so beautiful that it makes you feel good to look at it or even to think about it</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">(a thing)</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left">gorgeous</td>
<td class="left">extremely beautiful or handsome</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left">fair</td>
<td class="left">beautiful light in color, esp. skin or hair</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">(woman in poet)</td>
</tr>
</tbody>
</table>
</div>
</div>
