general/english/en_vocab_diff.org
** famous

| famous        | widely known or honored                                                                          |
|---------------+--------------------------------------------------------------------------------------------------|
| well-known    | (informal)                                                                                       |
|---------------+--------------------------------------------------------------------------------------------------|
| distinguished | great, outstanding, marked by excellent quality or deserved fame                                 |
|               | esp. for serious work in science, arts etc.                                                      |
|               | e.g. He was a distinguished writer.                                                              |
|---------------+--------------------------------------------------------------------------------------------------|
| celebrated    | refers objectively to sb. that has been give acclaim or honoured with awards or prizes           |
|               | e.g. She was a celebrated actress.                                                               |
|---------------+--------------------------------------------------------------------------------------------------|
| renowned      | highly honored and famous for sth. good, often refers to places or things                        |
|               | suggests sth. that become legendary or is no longer available for an objective evaluation        |
|               | e.g. Edison was renowned for his inventions.                                                     |
|---------------+--------------------------------------------------------------------------------------------------|
| noted         | well-known and admired                                                                           |
|               | often describes a more intellectual effort and accomplishment, indicating an authority or expert |
|               | e.g. He was a very noted expert.                                                                 |
|---------------+--------------------------------------------------------------------------------------------------|
| notorious     | famous for sth. bad                                                                              |
|               | e.g. He is notorious for his crimes.                                                             |

** special

| special    |        | different in some way from what is common, ordinary, or usual            |
|            |        | stresses having a quality, character, identity, or use of its own        |
|            |        | e.g. The tube contains special gases.                                    |
|------------+--------+--------------------------------------------------------------------------|
| especial   | 特别的 | to an usually great degree, exceptional                                  |
|            |        | emphasizes the _importance_ of the things or the persons mentioned       |
|            |        | e.g. This is a matter of especial importance.                            |
|------------+--------+--------------------------------------------------------------------------|
| particular | 个别的 | relating or belonging to only one thing or person                        |
|            |        | stresses the _distinctness_ of sth. as an individual which is worth notice |
|            |        | e.g. In that particular case, the rule doesn't hold.                     |
|------------+--------+--------------------------------------------------------------------------|
| specific   | 专门的 | detailed and exact, clear in meaning and explanation, fixed, determined  |
|            |        | implies a quality or character _distinguishing_ a kind or a species      |
|            |        | e.g. There is a specific tool for each job.                              |
|------------+--------+--------------------------------------------------------------------------|
| peculiar   | 独特的 | strange or perhaps unpleasant                                            |
|            |        | implies _strangeness_                                                    |
|            |        | e.g. He has a peculiar way of speaking.                                  |
