general/english/en_vocab_diff.html

<div id="outline-container-sec-3-2" class="outline-3">
<h3 id="sec-3-2"><span class="section-number-3">3.2</span> famous</h3>
<div class="outline-text-3" id="text-3-2">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />

<col  class="left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="left">famous</th>
<th scope="col" class="left">widely known or honored</th>
</tr>
</thead>
<tbody>
<tr>
<td class="left">well-known</td>
<td class="left">(informal)</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left">distinguished</td>
<td class="left">great, outstanding, marked by excellent quality or deserved fame</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">esp. for serious work in science, arts etc.</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">e.g. He was a distinguished writer.</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left">celebrated</td>
<td class="left">refers objectively to sb. that has been give acclaim or honoured with awards or prizes</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">e.g. She was a celebrated actress.</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left">renowned</td>
<td class="left">highly honored and famous for sth. good, often refers to places or things</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">suggests sth. that become legendary or is no longer available for an objective evaluation</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">e.g. Edison was renowned for his inventions.</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left">noted</td>
<td class="left">well-known and admired</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">often describes a more intellectual effort and accomplishment, indicating an authority or expert</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">e.g. He was a very noted expert.</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left">notorious</td>
<td class="left">famous for sth. bad</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">e.g. He is notorious for his crimes.</td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-sec-3-3" class="outline-3">
<h3 id="sec-3-3"><span class="section-number-3">3.3</span> special</h3>
<div class="outline-text-3" id="text-3-3">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />

<col  class="left" />

<col  class="left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="left">special</th>
<th scope="col" class="left">&#xa0;</th>
<th scope="col" class="left">different in some way from what is common, ordinary, or usual</th>
</tr>

<tr>
<th scope="col" class="left">&#xa0;</th>
<th scope="col" class="left">&#xa0;</th>
<th scope="col" class="left">stresses having a quality, character, identity, or use of its own</th>
</tr>

<tr>
<th scope="col" class="left">&#xa0;</th>
<th scope="col" class="left">&#xa0;</th>
<th scope="col" class="left">e.g. The tube contains special gases.</th>
</tr>
</thead>
<tbody>
<tr>
<td class="left">especial</td>
<td class="left">特别的</td>
<td class="left">to an usually great degree, exceptional</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">emphasizes the <span class="underline">importance</span> of the things or the persons mentioned</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">e.g. This is a matter of especial importance.</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left">particular</td>
<td class="left">个别的</td>
<td class="left">relating or belonging to only one thing or person</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">stresses the <span class="underline">distinctness</span> of sth. as an individual which is worth notice</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">e.g. In that particular case, the rule doesn't hold.</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left">specific</td>
<td class="left">专门的</td>
<td class="left">detailed and exact, clear in meaning and explanation, fixed, determined</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">implies a quality or character <span class="underline">distinguishing</span> a kind or a species</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">e.g. There is a specific tool for each job.</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left">peculiar</td>
<td class="left">独特的</td>
<td class="left">strange or perhaps unpleasant</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">implies <span class="underline">strangeness</span></td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">e.g. He has a peculiar way of speaking.</td>
</tr>
</tbody>
</table>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Created: 2016-05-22 周日 09:22</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 24.3.1 (<a href="http://orgmode.org">Org</a> mode 8.2.5h)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
